In [2]:
import pandas as pd

In [3]:
data = [4, 7, -5, 3]
s1 = pd.Series(data)
type(s1)

pandas.core.series.Series

In [5]:
people = {
    "name": ["John","Jane", "Joe", "Janet", "Jules"],
    "age": [23, 41, 34, 40, 55]
}
df = pd.DataFrame(people)
type(df)

pandas.core.frame.DataFrame

In [6]:
s1 = pd.Series([25, 30, 35, 40], name='age')
s2 = pd.Series(['New York', 'San Francisco', 'Los Angeles', 'Chicago'], name='city')

In [8]:
df2 = pd.concat([s1, s2], axis=1)
type(df2)

pandas.core.frame.DataFrame

In [10]:
import pandas as pd

file_path = 'data/listings.csv'
df = pd.read_csv(file_path)
df.head()

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365,number_of_reviews_ltm,license
0,2818,Quiet Garden View Room & Super Fast Wi-Fi,3159,Daniel,NaN,Oostelijk Havengebied - Indische Buurt,52.36435,4.94358,Private room,69,3,322,2023-02-28,1.90,1,44,37,0363 5F3A 5684 6750 D14D
1,20168,Studio with private bathroom in the centre 1,59484,Alexander,NaN,Centrum-Oost,52.36407,4.89393,Private room,106,1,339,2020-04-09,2.14,2,0,0,0363 CBB3 2C10 0C2A 1E29
2,27886,"Romantic, stylish B&B houseboat in canal district",97647,Flip,NaN,Centrum-West,52.38761,4.89188,Private room,143,3,248,2023-02-26,1.82,1,14,20,0363 974D 4986 7411 88D8
3,28871,Comfortable double room,124245,Edwin,NaN,Centrum-West,52.36775,4.89092,Private room,76,2,476,2023-02-28,3.12,2,79,97,0363 607B EA74 0BD8 2F6F
4,29051,Comfortable single room,124245,Edwin,NaN,Centrum-Oost,52.36584,4.89111,Private room,56,2,618,2023-03-03,4.23,2,69,85,0363 607B EA74 0BD8 2F6F

In [11]:
type(df)

pandas.core.frame.DataFrame

In [14]:
file_path = 'data/tf.xlsx'
df = pd.read_excel(file_path)
print(df.head())

   customerID  gender  SeniorCitizen Partner Dependents  tenure PhoneService  \
0  7590-VHVEG  Female              0     Yes         No       1           No
1  5575-GNVDE    Male              0      No         No      34          Yes
2  3668-QPYBK    Male              0      No         No       2          Yes
3  7795-CFOCW    Male              0      No         No      45           No
4  9237-HQITU  Female              0      No         No       2          Yes

      MultipleLines InternetService OnlineSecurity  ... DeviceProtection  \
0  No phone service             DSL             No  ...               No
1                No             DSL            Yes  ...              Yes
2                No             DSL            Yes  ...               No
3  No phone service             DSL            Yes  ...              Yes
4                No     Fiber optic             No  ...               No

  TechSupport StreamingTV StreamingMovies        Contract PaperlessBilling  \
0          No          No              No  Month-to-month              Yes
1          No          No              No        One year               No
2          No          No              No  Month-to-month              Yes
3         Yes          No              No        One year               No
4          No          No              No  Month-to-month              Yes

               PaymentMethod MonthlyCharges  TotalCharges Churn
0           Electronic check          29.85         29.85    No
1               Mailed check          56.95        1889.5    No
2               Mailed check          53.85        108.15   Yes
3  Bank transfer (automatic)          42.30       1840.75    No
4           Electronic check          70.70        151.65   Yes

[5 rows x 21 columns]

In [18]:
import pandas as pd

file_path = './data/athletes.json'
df = pd.read_json(file_path)
print(df)

                   Name  Age  Gender
0         Stephen Curry   33    male
1           Te'a Cooper   24  female
2          Lebron James   36    male
3       Serena Williams   39  female
4          Simone Biles   24  female
5  Giannis Antetokoumpo   26    male
6           Naomi Osaka   23  female
7            Chris Paul   36    male

In [19]:
import sqlite3

In [27]:
# Connect to the SQLite database
conn = sqlite3.connect('./data/example.db')

# Read data from the database using an SQL query
query = "SELECT * FROM employees"
df = pd.read_sql_query(query, conn)
print(df.head())

# Close the connection
conn.close()

      name  age           city
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   40        Chicago

In [23]:
data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'age': [25, 30, 35, 40],
    'city': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)
df.head()

      name  age           city
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   40        Chicago

In [24]:
file_path = 'data/output_data.csv'
df.to_csv(file_path, index=False)

In [25]:
data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'age': [25, 30, 35, 40],
    'city': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)

# Connect to the SQLite database
conn = sqlite3.connect('data/example.db')

# Write data to the database
table_name = 'employees'
df.to_sql(table_name, conn, if_exists='replace', index=False)

# Close the connection
conn.close()

In [28]:
data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank'],
    'age': [25, 30, 35, 40, 45, 50],
    'city': ['New York', 'San Francisco', 'Los Angeles', 'Chicago', 'Miami', 'Boston']
}
df = pd.DataFrame(data)

# Display the first 3 rows
df.head(3)

# Display the last 2 rows
df.tail(2)

    name  age    city
4    Eva   45   Miami
5  Frank   50  Boston

In [29]:
data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'age': [25, 30, 35, 40],
    'city': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data, index=['A', 'B', 'C', 'D'])

In [30]:
df

      name  age           city
A    Alice   25       New York
B      Bob   30  San Francisco
C  Charlie   35    Los Angeles
D    David   40        Chicago

In [32]:
print(df.loc[["A","C"]])

      name  age         city
A    Alice   25     New York
C  Charlie   35  Los Angeles

In [33]:
print(df.loc["A","city"])

New York

In [36]:
print(df.loc[:, ["name", "age"]])

      name  age
A    Alice   25
B      Bob   30
C  Charlie   35
D    David   40

In [37]:
print(df.iloc[0])

name       Alice
age           25
city    New York
Name: A, dtype: object

In [38]:
print(df.iloc[[0,2]])

      name  age         city
A    Alice   25     New York
C  Charlie   35  Los Angeles

In [39]:
print(df.iloc[0, 2])

New York

In [40]:
print(df.at["A", "city"])

New York

In [41]:

data = {
    'age': [25, 30, 35, 40],
    'income': [50000, 55000, 60000, 65000]
}
df = pd.DataFrame(data)

In [43]:
df.describe(include="all")

             age        income
count   4.000000      4.000000
mean   32.500000  57500.000000
std     6.454972   6454.972244
min    25.000000  50000.000000
25%    28.750000  53750.000000
50%    32.500000  57500.000000
75%    36.250000  61250.000000
max    40.000000  65000.000000

In [44]:
data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'age': [25, 30, 35, 40],
    'city': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)

In [45]:
df

      name  age           city
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   40        Chicago

In [49]:
sorted_df = df.sort_values(by=["age","city"], ascending=False)
sorted_df

      name  age           city
3    David   40        Chicago
2  Charlie   35    Los Angeles
1      Bob   30  San Francisco
0    Alice   25       New York

In [50]:
older_30 = df[df["age"] > 30]
older_30

      name  age         city
2  Charlie   35  Los Angeles
3    David   40      Chicago

In [51]:
older_than_30 = df.query("age > 30")
older_than_30

      name  age         city
2  Charlie   35  Los Angeles
3    David   40      Chicago

In [52]:
df

      name  age           city
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   40        Chicago

In [53]:
cities = ["New York", "Chicago"]
filter_cities = df[df["city"].isin(cities)]
filter_cities

    name  age      city
0  Alice   25  New York
3  David   40   Chicago

In [32]:
data = {
    'department': ['HR', 'HR', 'IT', 'IT', 'Sales', 'Sales'],
    'employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank'],
    'salary': [50000, 55000, 60000, 62000, 70000, 72000]
}
df = pd.DataFrame(data)
df

  department employee  salary
0         HR    Alice   50000
1         HR      Bob   55000
2         IT  Charlie   60000
3         IT    David   62000
4      Sales      Eva   70000
5      Sales    Frank   72000

In [33]:
group_obj = df.groupby("department")
calc_sum = group_obj["salary"].sum()
calc_sum

department
HR       105000
IT       122000
Sales    142000
Name: salary, dtype: int64

In [34]:
calc_mean = group_obj.salary.mean()

In [35]:
calc_mean

department
HR       52500.0
IT       61000.0
Sales    71000.0
Name: salary, dtype: float64

In [36]:
aggregation = group_obj["salary"].agg(["mean", "sum"])
aggregation

               mean     sum
department
HR          52500.0  105000
IT          61000.0  122000
Sales       71000.0  142000

In [37]:
aggregate = df.groupby("department").salary.agg([np.mean, np.std])
aggregate

               mean          std
department
HR          52500.0  3535.533906
IT          61000.0  1414.213562
Sales       71000.0  1414.213562

Hello world

In [27]:
data = {
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'C': [7, 8, 9]
}
df = pd.DataFrame(data, index=['X', 'Y', 'Z'])
df

   A  B  C
X  1  4  7
Y  2  5  8
Z  3  6  9

In [28]:
df = df.rename(columns={"A": "Col_A", "B": "Col_B", "C": "Col_C"})
df

   Col_A  Col_B  Col_C
X      1      4      7
Y      2      5      8
Z      3      6      9

In [29]:
df = df.rename(index={'X': 'Row_X', 'Y': 'Row_Y', 'Z': 'Row_Z'})
df

       Col_A  Col_B  Col_C
Row_X      1      4      7
Row_Y      2      5      8
Row_Z      3      6      9

In [43]:
import numpy as np

data = {
    'A': [1, np.nan, 3],
    'B': [4, 5, np.nan],
    'C': [7, 8, 9]
}
df = pd.DataFrame(data)
df

     A    B  C
0  1.0  4.0  7
1  NaN  5.0  8
2  3.0  NaN  9

In [42]:
# Drop rows with missing values
df_no_na = df.dropna(subset=["B"])
print(df_no_na)

     A    B  C
0  1.0  4.0  7
1  NaN  5.0  8

In [44]:
df_missing = df.dropna(axis=1)
df_missing

   C
0  7
1  8
2  9

In [47]:
data = {
    'A': [1, np.nan, 3],
    'B': [4, 5, np.nan],
    'C': [7, 8, 9]
}
df = pd.DataFrame(data)
df

     A    B  C
0  1.0  4.0  7
1  NaN  5.0  8
2  3.0  NaN  9

In [48]:
df["B"] = df["B"].fillna(df["B"].mean())
print(df)

     A    B  C
0  1.0  4.0  7
1  NaN  5.0  8
2  3.0  4.5  9

In [49]:
data1 = {
    'A': [1, 2, 3],
    'B': [4, 5, 6]
}
data2 = {
    'A': [7, 8, 9],
    'B': [10, 11, 12]
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [50]:
df1

   A  B
0  1  4
1  2  5
2  3  6

In [51]:
df2

   A   B
0  7  10
1  8  11
2  9  12

In [53]:
df_vertical = pd.concat([df1, df2], ignore_index=True)
df_vertical

   A   B
0  1   4
1  2   5
2  3   6
3  7  10
4  8  11
5  9  12

In [57]:
data1 = {
    'A': [1, 2, 3, 21],
    'B': [4, 5, 6, 31]
}
data2 = {
    'A': [7, 8, 9, 51, 35],
    'B': [10, 11, 12, 61, 13]
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [58]:
df_horizontal = pd.concat([df1, df2], axis=1)
df_horizontal

      A     B   A   B
0   1.0   4.0   7  10
1   2.0   5.0   8  11
2   3.0   6.0   9  12
3  21.0  31.0  51  61
4   NaN   NaN  35  13

In [59]:
data1 = {
    'key': ['A', 'B', 'C'],
    'value': [1, 2, 3]
}
data2 = {
    'key': ['B', 'C', 'D'],
    'value': [4, 5, 6]
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [60]:
df1

  key  value
0   A      1
1   B      2
2   C      3

In [61]:
df2

  key  value
0   B      4
1   C      5
2   D      6

In [64]:
df_merged = pd.merge(df1, df2, on="key", suffixes=("_left", "_right"))
df_merged

  key  value_left  value_right
0   B           2            4
1   C           3            5

In [67]:
merged = df1.merge(df2, how="left", on="key", suffixes=("_left", "_right"))
merged

  key  value_left  value_right
0   A           1          NaN
1   B           2          4.0
2   C           3          5.0

In [68]:
data1 = {
    'A': [1, 2, 3],
    'B': [4, 5, 6]
}
data2 = {
    'C': [7, 8, 9],
    'D': [10, 11, 12]
}

df1 = pd.DataFrame(data1, index=['X', 'Y', 'Z'])
df2 = pd.DataFrame(data2, index=['Y', 'Z', 'W'])

# Join DataFrames using index (left join)
df_joined = df1.join(df2, how='left')
print(df_joined)

   A  B    C     D
X  1  4  NaN   NaN
Y  2  5  7.0  10.0
Z  3  6  8.0  11.0

In [69]:
data = {
    'date': ['2021-01-01', '2021-01-01', '2021-01-02', '2021-01-02'],
    'city': ['New York', 'Los Angeles', 'New York', 'Los Angeles'],
    'temperature': [32, 75, 30, 77],
    'humidity': [80, 10, 85, 5]
}
df = pd.DataFrame(data)

In [70]:
df

         date         city  temperature  humidity
0  2021-01-01     New York           32        80
1  2021-01-01  Los Angeles           75        10
2  2021-01-02     New York           30        85
3  2021-01-02  Los Angeles           77         5

In [71]:
df_pivoted = df.pivot(index="date", columns="city")
df_pivoted

           temperature             humidity
city       Los Angeles New York Los Angeles New York
date
2021-01-01          75       32          10       80
2021-01-02          77       30           5       85

In [72]:
gender = ["Male", "Female", "Female","Female","Male", "Male", "Female"]
status = ["Yes", "No", "Yes", "Yes", "No","Yes", "No"]
df_x = pd.DataFrame({"gender": gender, "status": status})
df_x

   gender status
0    Male    Yes
1  Female     No
2  Female    Yes
3  Female    Yes
4    Male     No
5    Male    Yes
6  Female     No

In [77]:
df_x_pivot = pd.pivot_table(
    data=df_x, 
    index="gender", 
    columns="status",
    aggfunc=["size"]
    )
df_x_pivot

       size
status   No Yes
gender
Female    2   2
Male      1   2

In [78]:
data = {
    'date': ['2021-01-01', '2021-01-02'],
    'New York_temperature': [32, 30],
    'New York_humidity': [80, 85],
    'Los Angeles_temperature': [75, 77],
    'Los Angeles_humidity': [10, 5]
}
df = pd.DataFrame(data)
df

,date,New York_temperature,New York_humidity,Los Angeles_temperature,Los Angeles_humidity
0,2021-01-01,32,80,75,10
1,2021-01-02,30,85,77,5

In [79]:
df_melted = pd.melt(df, id_vars='date', var_name='city_and_measure', value_name='value')
print(df_melted)

         date         city_and_measure  value
0  2021-01-01     New York_temperature     32
1  2021-01-02     New York_temperature     30
2  2021-01-01        New York_humidity     80
3  2021-01-02        New York_humidity     85
4  2021-01-01  Los Angeles_temperature     75
5  2021-01-02  Los Angeles_temperature     77
6  2021-01-01     Los Angeles_humidity     10
7  2021-01-02     Los Angeles_humidity      5

In [98]:
data = {
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'C': [7, 8, 9]
}
df = pd.DataFrame(data)
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [83]:
def odd(x):
    if x % 2 == 0:
        return "Even"
    else:
        return "Odd"

In [84]:
df["Odd/Even"] = df["C"].apply(odd)
df

   A  B  C Odd/Even
0  1  4  7      Odd
1  2  5  8     Even
2  3  6  9      Odd

In [87]:
def less_9(n, factor):
    value = n * factor
    if value < 9:
        return True
    else:
        return False

In [99]:
df_t = df.applymap(less_9, factor=4)
df_t

       A      B      C
0   True  False  False
1   True  False  False
2  False  False  False

In [100]:
data = {
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'C': [7, 8, 9]
}
df = pd.DataFrame(data)
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [101]:
df["D"] = [10,11, 12]
df

   A  B  C   D
0  1  4  7  10
1  2  5  8  11
2  3  6  9  12

In [102]:
df = df.drop(["D"], axis=1)
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [103]:
df["A"] = ["Jane","Joe", "Jael"]
df

      A  B  C
0  Jane  4  7
1   Joe  5  8
2  Jael  6  9